# macOS Dev Environment Brewfile
# Run with: brew bundle --file=./Brewfile

# ─── Taps ─────────────────────────────────────────
tap "elastic/tap"

# ─── Core CLI ─────────────────────────────────────
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "htop"
brew "tree"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fd"
brew "gh"
brew "cheat"
brew "fortune"

# ─── Build / libs (referenced by dotfiles .zshrc) ─
brew "openssl@3"
brew "zlib"
brew "readline"
brew "sqlite"
brew "libffi"
brew "bzip2"
brew "xz"
brew "libev"
brew "icu4c"
brew "openblas"
brew "graphviz"

# ─── Shell ────────────────────────────────────────
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"

# ─── Git signing ──────────────────────────────────
brew "gnupg"
brew "pinentry-mac"

# ─── Languages ────────────────────────────────────
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "nvm"
brew "pygments"
brew "pipx"
brew "uv"
brew "pre-commit"

# ─── Cloud / infra ────────────────────────────────
brew "awscli"
brew "azure-cli"
brew "kubectl"
brew "helm"
brew "terraform"
brew "vault"

# ─── Data stores ──────────────────────────────────
brew "redis"
# brew "elastic/tap/elasticsearch-full"

# ─── Media ────────────────────────────────────────
brew "ffmpeg"
brew "imagemagick"
brew "graphicsmagick"
brew "jpegoptim"
brew "optipng"
brew "webp"

# ─── Casks (apps) ─────────────────────────────────
cask "iterm2"
cask "font-meslo-lg-nerd-font"
cask "docker"
cask "google-cloud-sdk"
cask "google-drive"
cask "aws-vault"
cask "sublime-text"
cask "rectangle"
cask "1password"
cask "1password-cli"
